### 판다스 1도 모르는 사람이 시작할 수 있게 도와주는 판다스 튜토리얼 +Numpy까지<br>
18.11.10. <br>
suyeon, kim<br>

https://pandas.pydata.org/ <br>
open source <br>
BSD-licensed library providing high-performance<br>
easy-to-use data structures and data analysis tools for the Python programming language.<br>

http://www.numpy.org/<br>
fundamental package for scientific computing with Python<br>
a powerful N-dimensional array object<br>
sophisticated (broadcasting) functions<br>
tools for integrating C/C++ and Fortran code<br>
useful linear algebra, Fourier transform, and random number capabilities<br>

아래 자료들은 지금 튜토리얼이 끝나고 혹시 더 궁금한게 있거나 추가로 학습하고 싶을 때 찾아볼것.

https://dataitgirls2.github.io/10minutes2pandas/ <br>
판다스 쿡북 한글 10분완성

http://cs231n.github.io/python-numpy-tutorial/ <br>
넘파이 튜토리얼 (스탠포드대학교 CS231n)

1) 라이브러리 불러오기

In [1]:
import pandas as pd
import numpy as np

2) 객체 생성하기

pandas.Series <br>
class pandas.Series(data=None, index=None, dtype=None, name=None, copy=False, fastpath=False)

시리즈는 axis labels 를 포함한 일차원 배열을 뜻함<br>
각각의 매개변수는 data, index, dtype, copy.

In [2]:
s=pd.Series([1,3,5,np.nan,6,8])

In [3]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

3) 데이터 프레임 만들기

In [4]:
dates=pd.date_range('20181108', periods=3)

In [5]:
dates

DatetimeIndex(['2018-11-08', '2018-11-09', '2018-11-10'], dtype='datetime64[ns]', freq='D')

In [6]:
df=pd.DataFrame(np.random.randn(3,4), index=dates, columns=list('ABCD'))

In [7]:
df

                   A         B         C         D
2018-11-08 -0.697625  2.442617 -0.508051 -1.159471
2018-11-09 -0.345201 -0.912428  0.346485 -0.102420
2018-11-10  0.175457  1.232094  0.747033 -0.781929

딕셔너리로도 데이터 프레임을 만들어보자 (딕셔너리가 뭔지는 아시져.....?)

In [8]:
rawdata={'Name':['김수연','이경현','위규복','하종우','엄현우'], 'Age':[26,27,27,28,25],'Live':['신촌','혜화','일산','서초','일산']}

In [9]:
rawdata

{'Name': ['김수연', '이경현', '위규복', '하종우', '엄현우'],
 'Age': [26, 27, 27, 28, 25],
 'Live': ['신촌', '혜화', '일산', '서초', '일산']}

In [10]:
df2=pd.DataFrame(rawdata)

In [11]:
df2

  Name  Age Live
0  김수연   26   신촌
1  이경현   27   혜화
2  위규복   27   일산
3  하종우   28   서초
4  엄현우   25   일산

In [12]:
pd.DataFrame(df2, columns=["Age"])

   Age
0   26
1   27
2   27
3   28
4   25

In [13]:
df2.Name

0    김수연
1    이경현
2    위규복
3    하종우
4    엄현우
Name: Name, dtype: object

데이터타입 (dtypes) 알아보기

In [14]:
df2.dtypes

Name    object
Age      int64
Live    object
dtype: object

In [15]:
df2.loc[0] #인덱스를 기준으로 찾는다. 김수연은 0번째 인덱스

Name    김수연
Age      26
Live     신촌
Name: 0, dtype: object

In [16]:
df2["Age"].iloc[1:] #loc와 유사하지만 Column을 가져오네? 라는 것을 알고있으면 됨

1    27
2    27
3    28
4    25
Name: Age, dtype: int64

In [35]:
myteam=pd.Series(data=["y","y","y","y"], index=[0,1,2,3])

In [36]:
myteam

0    y
1    y
2    y
3    y
dtype: object

In [37]:
df2["Team"]=myteam

In [38]:
df2

  Name  Age Live Team    Old
0  김수연   26   신촌    y   True
1  이경현   27   혜화    y   True
2  위규복   27   일산    y   True
3  하종우   28   서초    y   True
4  엄현우   25   일산  NaN  False

In [39]:
old=df2.Age>25

In [40]:
df2["Old"]=old

In [41]:
df2

  Name  Age Live Team    Old
0  김수연   26   신촌    y   True
1  이경현   27   혜화    y   True
2  위규복   27   일산    y   True
3  하종우   28   서초    y   True
4  엄현우   25   일산  NaN  False

In [42]:
df2.T #행/열 바꾸기

         0     1     2     3      4
Name   김수연   이경현   위규복   하종우    엄현우
Age     26    27    27    28     25
Live    신촌    혜화    일산    서초     일산
Team     y     y     y     y    NaN
Old   True  True  True  True  False

In [43]:
df2.values

array([['김수연', 26, '신촌', 'y', True],
       ['이경현', 27, '혜화', 'y', True],
       ['위규복', 27, '일산', 'y', True],
       ['하종우', 28, '서초', 'y', True],
       ['엄현우', 25, '일산', nan, False]], dtype=object)

실제 값을 불러와보자~~

데이터는 http://archive.ics.uci.edu/ml/index.php 여기에 있는 값을 불러올거임 (여기에는 무료데이터셋이 많다. 여기있는 데이터 셋을 캐글에 제공하기도 했다.)
csv파일을 읽는 것은 이미 타이타닉 튜토리얼에서 진행해봄..
엑셀파일도 그와 유사한 방법으로 불러온다. (엑셀확장자를 csv확장자 대신에 넣으면 됨!!)

그래서 이번에는 그냥 인터넷에서 url로 데이터를 불러오는방법을 사용해볼거임.

우리가 쓸 데이터는 Wine Data 

http://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data

데이터에 대한 설명

http://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.names

In [46]:
data_url = 'http://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data'
df_data = pd.read_csv(data_url, sep=',', header = None)

In [49]:
df_data.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
1,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
2,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185
3,1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480
4,1,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735

In [57]:
df_data.columns = ['cluster','Alcohol','Malic acid', 'Ash', 'Alcalinity of ash', 'Magnesium', 'Total phenols', 'Flavanoids', 'Nonflavanoid phenols', 'Proanthocyanins', 'Color intensity', 'Hue' ,'OD280/OD315 of diluted wines', 'Proline']

In [58]:
df_data.head()

,cluster,Alcohol,Malic acid,Ash,Alcalinity of ash,Magnesium,Total phenols,Flavanoids,Nonflavanoid phenols,Proanthocyanins,Color intensity,Hue,OD280/OD315 of diluted wines,Proline
0,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
1,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
2,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185
3,1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480
4,1,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735

여기서 나름대로 위의 방법들을 써서 데이터를 뽑아내보자

예를 들면 알코올이 13도 이상인 인덱스는 몇 개가 있을까 뭐 요런..

일단은 여기까지가 준비한것의 끝.